# IsProductList Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationPart..::..IsProductList Method
FabricationPart Class See Also
---
Gets whether or not the fabrication part is a product list.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016 Subscription Release
# Syntax
C#
---
```text
public bool IsProductList()
```

Visual Basic
---
```text
Public Function IsProductList As Boolean
```

Visual C++
---
```text
public:
bool IsProductList()
```

# ### Return Value
Returns true if the fabrication part is a product list.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | the fabrication part is not a product list. |

# See Also
FabricationPart Class
Autodesk.Revit.DB Namespace